# Analyzing 120 years of Olympics History using SQL
This notebook is a documentation of the process of utlizing SQL to query data from PostgreSQL database.
<br/>

### Table of Content
1. Key Observations 
2. Installation
3. Data Exploration/Cleansing
4. Solving Problem Statements
5. Bonus

## 1. Key Observations

Below are some of the findings from the SQL queries.

1. USA is not amongst the countries that have participated in all of the Olympics. They have missed out on 1980 Summer Olympics due to political reasons.
2. There were no Olympics held in 1916, 1940 and 1944 and were the only Olympics to be cancelled due to war.
3. The 1956 Olympics were held twice in 2 different regions due to the weather when it was first held in Melbourne.
4. In the past 5 summer Olympics, USA has achieved the most gold medals. However, they were unable to replicate the results for the winter Olympics where Canada and Sweden are usually the regions with the most gold medals.
5. Russia was able to dominate both the Summer and Winter Olympics in 1988 and 1992. They have achieved the highest gold medals in the 4 Olympics held in 1988 and 1992.

# 2. Installation
<br/>

**Setting up the conda environment:**
<br/>

```
conda create -n sql python
conda activate sql
conda install ipython-sql sqlalchemy psycopg2 notebook pandas -c conda-forge
```

For assistance on connecting Jupyter notebook to Postgre SQL database, please refer to [QiuSheng Wu](https://www.youtube.com/watch?v=CTOpojJPn9M&ab_channel=QiushengWu) detailed step-by-step guide.

**Connecting to PostgreSQL database**

In [2]:
%load_ext sql

In [3]:
import os

In [4]:
host = "localhost"
database = "Olympic"
user = os.getenv('SQL_USER')
password = os.getenv('SQL_PASSWORD')

In [5]:
connection_string = f"postgresql://{user}:{password}@{host}/{database}"

In [6]:
%sql $connection_string

In [7]:
%%sql
SELECT *
from olympics_history_noc_regions
LIMIT 5

 * postgresql://postgres:***@localhost/Olympic
5 rows affected.

[('NOC', 'region', 'notes'),
 ('AFG', 'Afghanistan', None),
 ('AHO', 'Curacao', 'Netherlands Antilles'),
 ('ALB', 'Albania', None),
 ('ALG', 'Algeria', None)]

In [8]:
%%sql
SELECT *
from olympics_history
LIMIT 5

 * postgresql://postgres:***@localhost/Olympic
5 rows affected.

[(1, 'A Dijiang', 'M', '24', '180', '80', 'China', 'CHN', '1992 Summer', 1992, 'Summer', 'Barcelona', 'Basketball', "Basketball Men's Basketball", 'NA'),
 (2, 'A Lamusi', 'M', '23', '170', '60', 'China', 'CHN', '2012 Summer', 2012, 'Summer', 'London', 'Judo', "Judo Men's Extra-Lightweight", 'NA'),
 (3, 'Gunnar Nielsen Aaby', 'M', '24', 'NA', 'NA', 'Denmark', 'DEN', '1920 Summer', 1920, 'Summer', 'Antwerpen', 'Football', "Football Men's Football", 'NA'),
 (4, 'Edgar Lindenau Aabye', 'M', '34', 'NA', 'NA', 'Denmark/Sweden', 'DEN', '1900 Summer', 1900, 'Summer', 'Paris', 'Tug-Of-War', "Tug-Of-War Men's Tug-Of-War", 'Gold'),
 (5, 'Christine Jacoba Aaftink', 'F', '21', '185', '82', 'Netherlands', 'NED', '1988 Winter', 1988, 'Winter', 'Calgary', 'Speed Skating', "Speed Skating Women's 500 metres", 'NA')]

**Utilizing sqlalchemy**

In [9]:
from sqlalchemy import create_engine

In [10]:
engine = create_engine(connection_string)

In [11]:
from sqlalchemy import inspect

In [12]:
insp = inspect(engine)
insp.get_table_names()

['olympics_history', 'olympics_history_noc_regions']

## 3. Data Exploration/Cleansing

There are more distinct nocs than regions which means that a region may have multiple noc. When aggregating based on countries, it will be better to use region as the aggregate key rather than noc.

In [13]:
%%sql
SELECT COUNT(DISTINCT region) AS Distinct_Region, COUNT(DISTINCT noc) AS Distinct_Noc
FROM olympics_history_noc_regions

 * postgresql://postgres:***@localhost/Olympic
1 rows affected.

[(208, 231)]

In [14]:
%%sql
SELECT region, noc
FROM olympics_history_noc_regions
WHERE region
IN (SELECT region
    FROM olympics_history_noc_regions
    GROUP BY region
    HAVING COUNT(*) > 1)
LIMIT 5

 * postgresql://postgres:***@localhost/Olympic
5 rows affected.

[('Australia', 'ANZ'),
 ('Australia', 'AUS'),
 ('Czech Republic', 'BOH'),
 ('Canada', 'CAN'),
 ('China', 'CHN')]

For participants that did not win a medal, the value in the medal column is listed as NA. This is different from the NULL value.

In [15]:
%%sql
SELECT DISTINCT medal
FROM olympics_history

 * postgresql://postgres:***@localhost/Olympic
4 rows affected.

[('Bronze',), ('Silver',), ('NA',), ('Gold',)]

The noc key for Singapore in olympics_history file is 'SGP' while the noc in the olympics_history_noc_regions for Singapore is 'SIN'. When using a join clause, the Singapore data will be removed as there is no unique key in both datasets.
</br>

To fix this issue, we will be replacing the SIN to SGP directly in the olympics_history_noc_regions file.

In [16]:
%%sql
SELECT DISTINCT oh.noc, ohnr.region
FROM olympics_history oh
LEFT JOIN olympics_history_noc_regions ohnr
ON oh.noc = ohnr.noc
WHERE region IS NULL

 * postgresql://postgres:***@localhost/Olympic
0 rows affected.

[]

In [17]:
%%sql
Update olympics_history_noc_regions
SET noc = 'SGP'
WHERE noc = 'SIN'

 * postgresql://postgres:***@localhost/Olympic
0 rows affected.

[]

## 4. Problem Statements

Below is a list of 20 problem statements and the respective answers derived using sql queries. Query results have been limited to first 5 rows to improve readability.

**Q1. How many olympics games have been held?**

In [18]:
%%sql
SELECT COUNT(DISTINCT games) AS Total_Games
from olympics_history

 * postgresql://postgres:***@localhost/Olympic
1 rows affected.

[(51,)]

**Q2. List down all Olympics games held so far.**

In [19]:
%%sql
SELECT DISTINCT games, year, season, city
from olympics_history
ORDER BY games ASC

 * postgresql://postgres:***@localhost/Olympic
52 rows affected.

[('1896 Summer', 1896, 'Summer', 'Athina'),
 ('1900 Summer', 1900, 'Summer', 'Paris'),
 ('1904 Summer', 1904, 'Summer', 'St. Louis'),
 ('1906 Summer', 1906, 'Summer', 'Athina'),
 ('1908 Summer', 1908, 'Summer', 'London'),
 ('1912 Summer', 1912, 'Summer', 'Stockholm'),
 ('1920 Summer', 1920, 'Summer', 'Antwerpen'),
 ('1924 Summer', 1924, 'Summer', 'Paris'),
 ('1924 Winter', 1924, 'Winter', 'Chamonix'),
 ('1928 Summer', 1928, 'Summer', 'Amsterdam'),
 ('1928 Winter', 1928, 'Winter', 'Sankt Moritz'),
 ('1932 Summer', 1932, 'Summer', 'Los Angeles'),
 ('1932 Winter', 1932, 'Winter', 'Lake Placid'),
 ('1936 Summer', 1936, 'Summer', 'Berlin'),
 ('1936 Winter', 1936, 'Winter', 'Garmisch-Partenkirchen'),
 ('1948 Summer', 1948, 'Summer', 'London'),
 ('1948 Winter', 1948, 'Winter', 'Sankt Moritz'),
 ('1952 Summer', 1952, 'Summer', 'Helsinki'),
 ('1952 Winter', 1952, 'Winter', 'Oslo'),
 ('1956 Summer', 1956, 'Summer', 'Melbourne'),
 ('1956 Summer', 1956, 'Summer', 'Stockholm'),
 ('1956 Winter', 1956, 'Winter', "Cortina d'Ampezzo"),
 ('1960 Summer', 1960, 'Summer', 'Roma'),
 ('1960 Winter', 1960, 'Winter', 'Squaw Valley'),
 ('1964 Summer', 1964, 'Summer', 'Tokyo'),
 ('1964 Winter', 1964, 'Winter', 'Innsbruck'),
 ('1968 Summer', 1968, 'Summer', 'Mexico City'),
 ('1968 Winter', 1968, 'Winter', 'Grenoble'),
 ('1972 Summer', 1972, 'Summer', 'Munich'),
 ('1972 Winter', 1972, 'Winter', 'Sapporo'),
 ('1976 Summer', 1976, 'Summer', 'Montreal'),
 ('1976 Winter', 1976, 'Winter', 'Innsbruck'),
 ('1980 Summer', 1980, 'Summer', 'Moskva'),
 ('1980 Winter', 1980, 'Winter', 'Lake Placid'),
 ('1984 Summer', 1984, 'Summer', 'Los Angeles'),
 ('1984 Winter', 1984, 'Winter', 'Sarajevo'),
 ('1988 Summer', 1988, 'Summer', 'Seoul'),
 ('1988 Winter', 1988, 'Winter', 'Calgary'),
 ('1992 Summer', 1992, 'Summer', 'Barcelona'),
 ('1992 Winter', 1992, 'Winter', 'Albertville'),
 ('1994 Winter', 1994, 'Winter', 'Lillehammer'),
 ('1996 Summer', 1996, 'Summer', 'Atlanta'),
 ('1998 Winter', 1998, 'Winter', 'Nagano'),
 ('2000 Summer', 2000, 'Summer', 'Sydney'),
 ('2002 Winter', 2002, 'Winter', 'Salt Lake City'),
 ('2004 Summer', 2004, 'Summer', 'Athina'),
 ('2006 Winter', 2006, 'Winter', 'Torino'),
 ('2008 Summer', 2008, 'Summer', 'Beijing'),
 ('2010 Winter', 2010, 'Winter', 'Vancouver'),
 ('2012 Summer', 2012, 'Summer', 'London'),
 ('2014 Winter', 2014, 'Winter', 'Sochi'),
 ('2016 Summer', 2016, 'Summer', 'Rio de Janeiro')]

**Q3. Mention the total no of nations who participated in each olympics game?**

In [20]:
%%sql
SELECT OH.games, COUNT(DISTINCT OHNR.region) AS participation
FROM olympics_history OH
INNER JOIN olympics_history_noc_regions OHNR
ON OH.noc = OHNR.noc
GROUP BY OH.games
limit 5

 * postgresql://postgres:***@localhost/Olympic
5 rows affected.

[('1896 Summer', 12),
 ('1900 Summer', 31),
 ('1904 Summer', 14),
 ('1906 Summer', 20),
 ('1908 Summer', 22)]

**Q4. Which year saw the highest and lowest no of countries participating in olympics?**

In [21]:
%%sql
SELECT *
FROM (
    SELECT OH.year, COUNT(DISTINCT OHNR.region) AS participation
    FROM olympics_history OH
    INNER JOIN olympics_history_noc_regions OHNR
    ON OH.noc = OHNR.noc
    GROUP BY OH.year
) AS PARTIPATE
ORDER BY participation DESC
LIMIT 1

 * postgresql://postgres:***@localhost/Olympic
1 rows affected.

[(2016, 205)]

In [22]:
%%sql
SELECT *
FROM (
    SELECT OH.year, COUNT(DISTINCT OHNR.region) AS participation
    FROM olympics_history OH
    INNER JOIN olympics_history_noc_regions OHNR
    ON OH.noc = OHNR.noc
    GROUP BY OH.year
) AS PARTIPATE
ORDER BY participation ASC
LIMIT 1

 * postgresql://postgres:***@localhost/Olympic
1 rows affected.

[(1896, 12)]

**Q5. Which nation has participated in all of the olympic games?**
</br>
UK, Swizerland, Italy and France has participated in all the olympic games. Interestingly, USA has missed 1 olympic game in 1980 due to political reasons.

In [23]:
%%sql
SELECT region, SUM(participation) AS events_participated
FROM (
    SELECT OH.games, OHNR.region, COUNT(DISTINCT OHNR.region) as participation
    FROM olympics_history OH
    INNER JOIN olympics_history_noc_regions OHNR
    ON OH.noc = OHNR.noc
    GROUP BY OH.games, OHNR.region
) AS TABLE1
GROUP by region
ORDER BY events_participated DESC
LIMIT 5

 * postgresql://postgres:***@localhost/Olympic
5 rows affected.

[('Switzerland', Decimal('51')),
 ('France', Decimal('51')),
 ('UK', Decimal('51')),
 ('Italy', Decimal('51')),
 ('Sweden', Decimal('50'))]

**Q6. Identify the sport which was played in all summer olympics.**

In [24]:
%%sql
SELECT sport, SUM(participation) AS sport_available, SUM(total_games) AS total_games
FROM (
    SELECT games, sport, COUNT(DISTINCT sport) AS participation, COUNT(DISTINCT games) AS total_games
    FROM olympics_history
    GROUP BY games, sport
) AS TABLE1
GROUP by sport
ORDER BY sport_available DESC
LIMIT 5

 * postgresql://postgres:***@localhost/Olympic
5 rows affected.

[('Gymnastics', Decimal('29'), Decimal('29')),
 ('Athletics', Decimal('29'), Decimal('29')),
 ('Cycling', Decimal('29'), Decimal('29')),
 ('Fencing', Decimal('29'), Decimal('29')),
 ('Swimming', Decimal('29'), Decimal('29'))]

**Q7. Which Sports were just played once in the olympics?**

In [25]:
%%sql
SELECT sport, SUM(participation) AS sport_available
FROM (
    SELECT games, sport, COUNT(DISTINCT sport) AS participation
    FROM olympics_history
    GROUP BY games, sport
) AS TABLE1
GROUP by sport
ORDER BY sport_available ASC
LIMIT 10

 * postgresql://postgres:***@localhost/Olympic
10 rows affected.

[('Roque', Decimal('1')),
 ('Racquets', Decimal('1')),
 ('Military Ski Patrol', Decimal('1')),
 ('Cricket', Decimal('1')),
 ('Motorboating', Decimal('1')),
 ('Croquet', Decimal('1')),
 ('Aeronautics', Decimal('1')),
 ('Jeu De Paume', Decimal('1')),
 ('Basque Pelota', Decimal('1')),
 ('Rugby Sevens', Decimal('1'))]

**Q8. Fetch the total no of sports played in each olympic games.**

In [26]:
%%sql
SELECT games, COUNT(DISTINCT sport)
FROM olympics_history
GROUP BY games
LIMIT 5

 * postgresql://postgres:***@localhost/Olympic
5 rows affected.

[('1896 Summer', 9),
 ('1900 Summer', 20),
 ('1904 Summer', 18),
 ('1906 Summer', 13),
 ('1908 Summer', 24)]

**Q9. Fetch details of the oldest atheletes to win a gold medal.**

In [27]:
%%sql
SELECT *
FROM olympics_history
WHERE NOT age = 'NA'
AND medal = 'Gold' 
ORDER BY age DESC
LIMIT 2

 * postgresql://postgres:***@localhost/Olympic
2 rows affected.

[(53238, 'Charles Jacobus', 'M', '64', 'NA', 'NA', 'United States', 'USA', '1904 Summer', 1904, 'Summer', 'St. Louis', 'Roque', "Roque Men's Singles", 'Gold'),
 (117046, 'Oscar Gomer Swahn', 'M', '64', 'NA', 'NA', 'Sweden', 'SWE', '1912 Summer', 1912, 'Summer', 'Stockholm', 'Shooting', "Shooting Men's Running Target, Single Shot, Team", 'Gold')]

**Q10. Find the Ratio of male and female atheletes participated in all olympic games.**

In [28]:
%%sql
with male (male_participants) as
        (SELECT COUNT(*)
        from olympics_history
        where sex = 'M'),
    female (female_participants) as
        (SELECT COUNT(*)
        from olympics_history
        where sex = 'F')
SELECT concat('1 : ', round(CAST(m.male_participants AS decimal)/f.female_participants,2)) as ratio
from male m, female f

 * postgresql://postgres:***@localhost/Olympic
1 rows affected.

[('1 : 2.64',)]

**Q11. Fetch the top 5 athletes who have won the most gold medals.**

In [29]:
%%sql
SELECT name, COUNT(medal) AS medals_won
FROM olympics_history
WHERE medal = 'Gold'
GROUP BY name
ORDER BY medals_won DESC
LIMIT 5

 * postgresql://postgres:***@localhost/Olympic
5 rows affected.

[('Michael Fred Phelps, II', 23),
 ('Raymond Clarence "Ray" Ewry', 10),
 ('Frederick Carlton "Carl" Lewis', 9),
 ('Paavo Johannes Nurmi', 9),
 ('Mark Andrew Spitz', 9)]

**Q12. Fetch the top 5 athletes who have won the most medals (gold/silver/bronze).**

In [30]:
%%sql
SELECT name, COUNT(medal) AS medals_won
FROM olympics_history
WHERE medal = 'Gold' or medal = 'Silver' or medal = 'Bronze'
GROUP BY name
ORDER BY medals_won DESC
LIMIT 5

 * postgresql://postgres:***@localhost/Olympic
5 rows affected.

[('Michael Fred Phelps, II', 28),
 ('Larysa Semenivna Latynina (Diriy-)', 18),
 ('Nikolay Yefimovich Andrianov', 15),
 ('Ole Einar Bjrndalen', 13),
 ('Takashi Ono', 13)]

**Q13. Fetch the top 5 most successful countries in olympics. Success is defined by no of medals won.**

In [31]:
%%sql
SELECT ohnr.region, COUNT(medal) AS medals_won
FROM olympics_history oh
JOIN olympics_history_noc_regions ohnr
ON oh.noc = ohnr.noc
WHERE NOT oh.medal = 'NA'
GROUP BY ohnr.region
ORDER BY medals_won DESC
LIMIT 5

 * postgresql://postgres:***@localhost/Olympic
5 rows affected.

[('USA', 5637),
 ('Russia', 3947),
 ('Germany', 3756),
 ('UK', 2068),
 ('France', 1777)]

**Q14. List down total gold, silver and bronze medals won by each country.**

In [32]:
%%sql
SELECT region,
max(case when (medal = 'Gold') then medals_won else 0 end) as gold,
max(case when (medal = 'Silver') then medals_won else 0 end) as silver,
max(case when (medal = 'Bronze') then medals_won else 0 end) as bronze
FROM
(
    SELECT ohnr.region, oh.medal, count(*) AS medals_won
    FROM olympics_history oh
    JOIN olympics_history_noc_regions ohnr
    ON oh.noc = ohnr.noc
    WHERE NOT medal = 'NA'
    GROUP BY ohnr.region, oh.medal
) AS t
GROUP BY region
ORDER BY gold DESC
LIMIT 5

 * postgresql://postgres:***@localhost/Olympic
5 rows affected.

[('USA', 2638, 1641, 1358),
 ('Russia', 1599, 1170, 1178),
 ('Germany', 1301, 1195, 1260),
 ('UK', 678, 739, 651),
 ('Italy', 575, 531, 531)]

**Q15. List down total gold, silver and bronze medals won by each country corresponding to each olympic games.**

In [33]:
%%sql
SELECT games, region,
max(case when (medal = 'Gold') then medals_won else 0 end) as gold,
max(case when (medal = 'Silver') then medals_won else 0 end) as silver,
max(case when (medal = 'Bronze') then medals_won else 0 end) as bronze
FROM
(
    SELECT oh.games, ohnr.region, oh.medal, count(*) AS medals_won
    FROM olympics_history oh
    JOIN olympics_history_noc_regions ohnr
    ON oh.noc = ohnr.noc
    WHERE NOT medal = 'NA'
    GROUP BY oh.games, ohnr.region, oh.medal

) AS t
GROUP BY games, region
ORDER BY games ASC
LIMIT 5

 * postgresql://postgres:***@localhost/Olympic
5 rows affected.

[('1896 Summer', 'Australia', 2, 0, 1),
 ('1896 Summer', 'Austria', 2, 1, 2),
 ('1896 Summer', 'Denmark', 1, 2, 3),
 ('1896 Summer', 'France', 5, 4, 2),
 ('1896 Summer', 'Germany', 25, 5, 2)]

**Q16. Identify which country won the most gold, most silver, most bronze medals in each olympic games.**

In [34]:
%%sql
with t1 as (
        SELECT oh.games, ohnr.region, oh.medal, count(*) AS medals_won
        FROM olympics_history oh
        JOIN olympics_history_noc_regions ohnr
        on oh.noc = ohnr.noc
        WHERE NOT oh.medal = 'NA'
        GROUP BY oh.games, ohnr.region, oh.medal),
     t2 as (
        SELECT games, region, medal, medals_won,
        RANK() OVER (PARTITION BY games, medal ORDER BY medals_won DESC) medals_rank
        FROM t1),
     t3 as (
        SELECT games, medal, concat(region, ' - ', medals_won) AS winner
        FROM t2
        WHERE medals_rank = 1)
SELECT games,
max(case when (medal = 'Gold') then winner else NULL end) as gold,
max(case when (medal = 'Silver') then winner else NULL end) as silver,
max(case when (medal = 'Bronze') then winner else NULL end) as bronze
FROM t3
GROUP BY games
LIMIT 5

 * postgresql://postgres:***@localhost/Olympic
5 rows affected.

[('1896 Summer', 'Germany - 25', 'Greece - 18', 'Greece - 20'),
 ('1900 Summer', 'UK - 59', 'France - 101', 'France - 82'),
 ('1904 Summer', 'USA - 128', 'USA - 141', 'USA - 125'),
 ('1906 Summer', 'Greece - 24', 'Greece - 48', 'Greece - 30'),
 ('1908 Summer', 'UK - 147', 'UK - 131', 'UK - 90')]

**Q17. Identify which country won the most gold, most silver, most bronze medals and the most medals in each olympic games.**

In [35]:
%%sql
with t1 as (
        SELECT oh.games, ohnr.region, oh.medal, count(*) AS medals_won
        FROM olympics_history oh
        JOIN olympics_history_noc_regions ohnr
        on oh.noc = ohnr.noc
        WHERE NOT oh.medal = 'NA'
        GROUP BY oh.games, ohnr.region, oh.medal),
    t2 as (
        SELECT games, region, medal, medals_won,
        RANK() OVER (PARTITION BY games, medal ORDER BY medals_won DESC) medals_rank
        FROM t1),
    t3 as (
        SELECT games, medal, concat(region, ' - ', medals_won) AS winner
        FROM t2
        WHERE medals_rank = 1),
    t4 as (
        SELECT oh.games, ohnr.region, count(*) as total_medals_won
        FROM olympics_history oh
        JOIN olympics_history_noc_regions ohnr
        ON oh.noc = ohnr.noc
        WHERE NOT oh.medal = 'NA'
        GROUP BY oh.games, ohnr.region),
    t5 as (
        SELECT games, region, total_medals_won,
        RANK() OVER (PARTITION BY games ORDER BY total_medals_won DESC) total_medals_rank
        from t4),
    t6 as (
        SELECT games, concat(region, ' - ', total_medals_won) AS overallwinner
        FROM t5
        WHERE total_medals_rank = 1),
    t7 as (
        SELECT games, 
        max(case when (medal = 'Gold') then winner else NULL end) as gold,
        max(case when (medal = 'Silver') then winner else NULL end) as silver,
        max(case when (medal = 'Bronze') then winner else NULL end) as bronze
        FROM t3
        GROUP BY games)
SELECT t7.games, t7.gold, t7.silver, t7.bronze,  t6.overallwinner
FROM t7
INNER JOIN t6
ON t6.games = t7.games
LIMIT 5

 * postgresql://postgres:***@localhost/Olympic
5 rows affected.

[('1896 Summer', 'Germany - 25', 'Greece - 18', 'Greece - 20', 'Greece - 48'),
 ('1900 Summer', 'UK - 59', 'France - 101', 'France - 82', 'France - 235'),
 ('1904 Summer', 'USA - 128', 'USA - 141', 'USA - 125', 'USA - 394'),
 ('1906 Summer', 'Greece - 24', 'Greece - 48', 'Greece - 30', 'Greece - 102'),
 ('1908 Summer', 'UK - 147', 'UK - 131', 'UK - 90', 'UK - 368')]

**Q18. Which countries have never won gold medal but have won silver/bronze medals?**

In [36]:
%%sql
with t1 as (
        SELECT oh.games, ohnr.region, oh.medal, count(*) AS medals_won
        FROM olympics_history oh
        JOIN olympics_history_noc_regions ohnr
        ON oh.noc = ohnr.noc
        WHERE NOT medal = 'NA'
        GROUP BY oh.games, ohnr.region, oh.medal),
    t2 as (
        SELECT region,
        max(case when (medal = 'Gold') then medals_won else 0 end) as gold,
        max(case when (medal = 'Silver') then medals_won else 0 end) as silver,
        max(case when (medal = 'Bronze') then medals_won else 0 end) as bronze
        FROM t1
        GROUP BY region)
SELECT *
FROM t2
WHERE gold = 0 AND (silver > 0 OR bronze > 0)
LIMIT 5

 * postgresql://postgres:***@localhost/Olympic
5 rows affected.

[('Montenegro', 0, 14, 0),
 ('Macedonia', 0, 0, 1),
 ('Sri Lanka', 0, 1, 0),
 ('Saudi Arabia', 0, 1, 4),
 ('Kyrgyzstan', 0, 1, 1)]

**Q19. In which Sport/event, India has won highest medals.**

In [37]:
%%sql
SELECT ohnr.region, oh.sport, count(*) As medals_won
FROM olympics_history oh
JOIN olympics_history_noc_regions ohnr
ON oh.noc = ohnr.noc
WHERE medal <> 'NA' AND region = 'India'
GROUP BY ohnr.region, oh.sport
ORDER BY medals_won DESC
LIMIT 1

 * postgresql://postgres:***@localhost/Olympic
1 rows affected.

[('India', 'Hockey', 173)]

**Q20. Break down all olympic games where India won medal for Hockey and how many medals in each olympic games.**

In [38]:
%%sql
SELECT ohnr.region, oh.games, oh.sport, count(*) As medals_won
FROM olympics_history oh
JOIN olympics_history_noc_regions ohnr
ON oh.noc = ohnr.noc
WHERE medal <> 'NA' AND region = 'India' AND sport = 'Hockey'
GROUP BY ohnr.region, oh.games, oh.sport
ORDER BY medals_won DESC
LIMIT 5

 * postgresql://postgres:***@localhost/Olympic
5 rows affected.

[('India', '1948 Summer', 'Hockey', 20),
 ('India', '1936 Summer', 'Hockey', 19),
 ('India', '1956 Summer', 'Hockey', 17),
 ('India', '1968 Summer', 'Hockey', 16),
 ('India', '1980 Summer', 'Hockey', 16)]

## 5. BONUS

Being a patrotic citizen of Singapore, it is my duty to know who are the people that have helped Singapore clinched an award.

In [39]:
%%sql
SELECT *
FROM olympics_history
WHERE noc = 'SGP' AND medal <> 'NA'

 * postgresql://postgres:***@localhost/Olympic
9 rows affected.

[(34619, 'Feng Tian Wei', 'F', '21', '163', '55', 'Singapore', 'SGP', '2008 Summer', 2008, 'Summer', 'Beijing', 'Table Tennis', "Table Tennis Women's Team", 'Silver'),
 (34619, 'Feng Tian Wei', 'F', '25', '163', '55', 'Singapore', 'SGP', '2012 Summer', 2012, 'Summer', 'London', 'Table Tennis', "Table Tennis Women's Singles", 'Bronze'),
 (34619, 'Feng Tian Wei', 'F', '25', '163', '55', 'Singapore', 'SGP', '2012 Summer', 2012, 'Summer', 'London', 'Table Tennis', "Table Tennis Women's Team", 'Bronze'),
 (69392, 'Li Jia Wei', 'F', '26', '170', '60', 'Singapore', 'SGP', '2008 Summer', 2008, 'Summer', 'Beijing', 'Table Tennis', "Table Tennis Women's Team", 'Silver'),
 (69392, 'Li Jia Wei', 'F', '30', '170', '60', 'Singapore', 'SGP', '2012 Summer', 2012, 'Summer', 'London', 'Table Tennis', "Table Tennis Women's Team", 'Bronze'),
 (107436, 'Joseph Isaac Schooling', 'M', '21', '184', '74', 'Singapore', 'SGP', '2016 Summer', 2016, 'Summer', 'Rio de Janeiro', 'Swimming', "Swimming Men's 100 metres Butterfly", 'Gold'),
 (118289, 'Howe Liang "Tiger" Tan', 'M', '27', '160', '69.5', 'Singapore', 'SGP', '1960 Summer', 1960, 'Summer', 'Roma', 'Weightlifting', "Weightlifting Men's Lightweight", 'Silver'),
 (128496, 'Wang Jue Gu', 'F', '28', '155', '63', 'Singapore', 'SGP', '2008 Summer', 2008, 'Summer', 'Beijing', 'Table Tennis', "Table Tennis Women's Team", 'Silver'),
 (128496, 'Wang Jue Gu', 'F', '32', '155', '63', 'Singapore', 'SGP', '2012 Summer', 2012, 'Summer', 'London', 'Table Tennis', "Table Tennis Women's Team", 'Bronze')]